# 판다스(Pandas)

```
uv add pandas
```

# 1. 시리즈(Series)

## 1) 생성 및 조회

<table>
    <thead>
        <tr>
            <th>이름</th><th>나이</th><th>키</th>
        </tr>
    </thead>
    <tbody>
        <tr><td>김영철</td><td>24</td><td>179.4</td></tr>
        <tr><td>송윤지</td><td>31</td><td>161.0</td></tr>
        <tr><td>임수현</td><td>26</td><td>174</td></tr>
    </tbody>
</table>

### (1) 데이터만 생성

데이터만 생성 후, index 설정

In [1]:
import pandas as pd

In [2]:
name_data = pd.Series(data=["김영철", "송윤지", "임수현"])
print(name_data)

0    김영철
1    송윤지
2    임수현
dtype: object

In [3]:
age_data1 = pd.Series(data=[24, 31, 26])
print(age_data1)

0    24
1    31
2    26
dtype: int64

In [5]:
height_data = pd.Series(data=[179.4, 161.0, 174])
print(height_data)

0    179.4
1    161.0
2    174.0
dtype: float64

In [5]:
# 데이터 만든 후, index 설정
age_data1.index = ["김영철", "송윤지", "임수현"]
print(age_data1)

김영철    24
송윤지    31
임수현    26
dtype: int64

<table>
    <thead>
        <tr>
            <th>이름</th><th>나이</th><th>키</th>
        </tr>
    </thead>
    <tbody>
        <tr><td>김영철</td><td>24</td><td>179.4</td></tr>
        <tr><td>송윤지</td><td>31</td><td>161.0</td></tr>
        <tr><td>임수현</td><td>26</td><td>174</td></tr>
    </tbody>
</table>

### (2) 인덱스와 함께 생성

In [ ]:
# 이름을 index로
age_data = pd.Series(
    data = [24, 31, 26],
    index = ["김영철", "송윤지", "임수현"]
)
print(age_data)

김영철    24
송윤지    31
임수현    26
dtype: int64

In [7]:
print(age_data.index)

Index(['김영철', '송윤지', '임수현'], dtype='object')

In [10]:
print(age_data.values)
print(type(age_data.values))

[24 31 26]
<class 'numpy.ndarray'>

## 2) 연산

In [11]:
data1 = pd.Series(data=[10, 20, 30])
data2 = pd.Series(data=[1, 2, 3])

data3 = data1 ** data2
print(data3)

0       10
1      400
2    27000
dtype: int64

## 3) 결측치

### (1) 결측치 발생

In [ ]:
import pandas as pd
import numpy as np

data = pd.Series([1, np.nan])
print(data)

# nan (not a number : 결측치)

In [12]:
data1 = pd.Series(data=[10, 20, 30])
data2 = pd.Series(data=[1, 2, 3, 4])

data3 = data1 + data2
print(data3)

0    11.0
1    22.0
2    33.0
3     NaN
dtype: float64

예제
* 데이터가 10, 20, 30인 시리즈 생성, 인덱스는 부산, 울산, 대구으로 설정
* 데이터가 1, 2, 3, 4인 시리즈 생성, 인덱스는 광주, 부산, 울산, 대구으로 설정
* 데이터의 덧셈

In [33]:
data1 = pd.Series(
    data=[10, 20, 30],
    index=["부산", "울산", "대구"]
)
data2 = pd.Series(
    data=[1, 2, 3, 4],
    index=["광주", "부산", "울산", "대구"]
)

print(data1)
print("="*20)
print(data2)

부산    10
울산    20
대구    30
dtype: int64
====================
광주    1
부산    2
울산    3
대구    4
dtype: int64

In [34]:
data3 = data1 + data2
print(data3)

# index 기준으로 연산이 진행된다

광주     NaN
대구    34.0
부산    12.0
울산    23.0
dtype: float64

### (2) 결측치 파악

In [35]:
data3.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, 광주 to 울산
Series name: None
Non-Null Count  Dtype
--------------  -----
3 non-null      float64
dtypes: float64(1)
memory usage: 64.0+ bytes

In [36]:
# 결측치 판단하기 (is na?)
data3.isna()

광주     True
대구    False
부산    False
울산    False
dtype: bool

In [37]:
# 결측치 갯수
data3.isna().sum()

np.int64(1)

### (3) 결측치 채우기

In [38]:
data3

광주     NaN
대구    34.0
부산    12.0
울산    23.0
dtype: float64

In [39]:
# 결측치 채우기 - 반드시 덮어씌워줘야 반영된다.
data4 = data3.fillna(0)

In [40]:
data4

광주     0.0
대구    34.0
부산    12.0
울산    23.0
dtype: float64

### (4) 결측치 삭제

In [41]:
# 결측치 삭제
data5 = data3.dropna()

In [42]:
data3

광주     NaN
대구    34.0
부산    12.0
울산    23.0
dtype: float64

In [ ]:
data3.dropna(inplace=True)  # 옵션 (덮어쓰지 않더라도 반영) -> 혼용하지 말자! (쓸거면 쓰고, 안쓸거면 안쓰고)

In [44]:
data3

대구    34.0
부산    12.0
울산    23.0
dtype: float64

## 4) 통계

In [45]:
data = pd.Series(
    data=[10, 20, 30],
    index=["부산", "울산", "대구"]
)
data

부산    10
울산    20
대구    30
dtype: int64

In [ ]:
print(data.min())       # 최소
print(data.mean())      # 평균
print(data.var())       # 분산      (데이터 - 평균)^2 / 전체 데이터 개수
print(data.std())       # 표준편차   루트(분산) (-> 분산보다 좀 더 직관적으로 떨어진 정도를 보여줌)
print(data.max())       # 최대

10
20.0
100.0
10.0
30

In [ ]:
data.describe()     # 한번에 요약해줌

count     3.0
mean     20.0
std      10.0
min      10.0
25%      15.0
50%      20.0
75%      25.0
max      30.0
dtype: float64

예제. 문자 데이터

```
['HR', 'Engineering', 'HR', 'Engineering', 'HR', 'Marketing', 'Engineering', 'Marketing', 'HR']
```

In [ ]:
data = pd.Series(
    data=['HR', 'Engineering', 'HR', 'Engineering', 'HR', 'Marketing', 'Engineering', 'Marketing', 'HR']
)
data.describe()

# 범주형(카테고리) 데이터는 describe 가 다르게 나온다

count      9
unique     3
top       HR
freq       4
dtype: object

# 2. 데이터프레임(DataFrame)

## 1) 생성

<table>
    <thead>
        <tr>
            <th>이름</th><th>성별</th><th>나이</th><th>키</th>
        </tr>
    </thead>
    <tbody>
        <tr><td>김영철</td><th>M</th><td>24</td><td>179.4</td></tr>
        <tr><td>송윤지</td><th>F</th><td>31</td><td>161.0</td></tr>
        <tr><td>임수현</td><th>F</th><td>26</td><td>174</td></tr>
    </tbody>
</table>

In [52]:
import pandas as pd

data_list = [
    ["김영철", "M", 24, 179.4],
    ["송윤지", "F", 31, 161.0],
    ["임수현", "F", 26, 174]
]
data1 = pd.DataFrame(data_list, columns = ["이름", "성별", "나이", "키"])
# data1.columns = ["이름", "성별", "나이", "키"]
data1

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

In [ ]:
# 열 딕셔너리 이용 ('열'이 키가됨)
data_col_dict = {
    "이름" : ["김영철", "송윤지", "임수현"],
    "성별" : ["M", "F", "F"],
    "나이" : [24, 31, 26],
    "키" : [179.4, 161.0, 174]
}
data2 = pd.DataFrame(data_col_dict)
data2

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

In [ ]:
# 행 딕셔너리 이용
data_row_list = [
    {"이름" : "김영철", "성별" : "M", "나이" : 24, "키" : 179.4},
    {"이름" : "송윤지", "성별" : "F", "나이" : 31, "키" : 161.0},
    {"이름" : "임수현", "성별" : "F", "나이" : 26, "키" : 174}
]
data3 = pd.DataFrame(data_row_list)
data3

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

In [57]:
# 이름 열을 인덱스로 설정하기(덮어쓰기 해야 함)
data4 = data1.set_index("이름")
data4

    성별  나이      키
이름
김영철  M  24  179.4
송윤지  F  31  161.0
임수현  F  26  174.0

In [ ]:
# 이름 인덱스를 다시 열로 바꾸기 (덮어쓰기 해야 함)
data5 = data4.reset_index()
data5

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

## 2) 조회

### (1) 이름으로 조회

In [62]:
data1

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

#### 열 조회

In [63]:
# 나이 열을 조회
data1["나이"]

0    24
1    31
2    26
Name: 나이, dtype: int64

In [ ]:
# 나이, 키 열을 조회 -> 리스트로 표현해 줘야함
data1[["나이", "키"]]

   나이      키
0  24  179.4
1  31  161.0
2  26  174.0

#### 행 조회

In [65]:
data4

    성별  나이      키
이름
김영철  M  24  179.4
송윤지  F  31  161.0
임수현  F  26  174.0

In [ ]:
# 송윤지 행 조회
data4.loc["송윤지"] #location

성별        F
나이       31
키     161.0
Name: 송윤지, dtype: object

In [68]:
# 김영철, 임수현 행 조회
data4.loc[["김영철", "임수현"]]

    성별  나이      키
이름
김영철  M  24  179.4
임수현  F  26  174.0

#### 셀 조회

In [69]:
data4

    성별  나이      키
이름
김영철  M  24  179.4
송윤지  F  31  161.0
임수현  F  26  174.0

In [ ]:
# 임수현 학생의 키 조회 [행, 열]
data4.loc["임수현", "키"]

np.float64(174.0)

In [72]:
# 송윤지 학생의 성별 조회
data4.loc["송윤지", "성별"]

'F'

In [76]:
data4.loc["김영철", "나이"]

np.int64(24)

### (2) 인덱스로 조회

In [77]:
data1

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

#### 열 조회

In [ ]:
데이터프레임.loc[행, 열]

In [ ]:
# 나이 열을 인덱스로 조회 (행을 전부 가져오고(:), 2에 대한 열을 가져와라)
data1.iloc[:,2]

0    24
1    31
2    26
Name: 나이, dtype: int64

In [ ]:
# 성별, 키 열을 인덱스로 조회
data1.iloc[:, [1,3]]

  성별      키
0  M  179.4
1  F  161.0
2  F  174.0

#### 행 조회

In [81]:
data4

    성별  나이      키
이름
김영철  M  24  179.4
송윤지  F  31  161.0
임수현  F  26  174.0

In [82]:
# 송윤지 학생의 데이터를 인덱스로 조회
data4.iloc[1,:]

성별        F
나이       31
키     161.0
Name: 송윤지, dtype: object

In [86]:
# 송윤지, 임수현 학생의 데이터를 인덱스로 조회
data4.iloc[1:, :]

    성별  나이      키
이름
송윤지  F  31  161.0
임수현  F  26  174.0

#### 셀 조회

In [87]:
data4

    성별  나이      키
이름
김영철  M  24  179.4
송윤지  F  31  161.0
임수현  F  26  174.0

In [88]:
# 임수현 학생의 성별을 인덱스로 조회
data4.iloc[2, 0]

'F'

In [89]:
# 김영철 학생의 키를 인덱스로 조회
data4.iloc[0, 2]

np.float64(179.4)

### (3) 조건부 조회

In [236]:
data1

,Region,Rating,Category,Review
0,인덕원,1,삼겹살 고기집,숙성 돼지고기 전문점입니다. 건물 모양 때문에 매장 모양도 좀 특이하지만 쾌적한 편...
1,인덕원,1,삼겹살 고기집,고기가 정말 맛있었어요! 육즙이 가득있어서 너무 좋았아요\n일하시는분들 너무 친절하...
2,인덕원,1,순대국 찹쌀순대,"잡내없고 깔끔, 담백한 맛의 순대국이 순대국을 안 좋아하는 사람들에게도 술술 넘어갈..."
3,인덕원,1,순대국 찹쌀순대,고기 양이 푸짐해서 특 순대국밥을 시킨 기분이 듭니다~~ 맛도 좋습니다\n다만 양념...
4,인덕원,1,순대국 찹쌀순대,순대국 자체는 제가 먹어본 순대국밥집 중에서 Top5 안에는 들어요.\n\n그러나 ...
...,...,...,...,...
642408,평택,2,일식/중식/세계음식,"요즘, 핫하게,,,떠오르구 있는 중국집. ㅋ, 맥주의 여파루 속이 안좋지만 와봄. ..."
642409,평택,0,한식,원래 글 안쓰는데 이거는 정말 다른분들 위해서 써야할것같네요 방금 포장주문 해서 왔...
642410,평택,1,한식,"우리팀 단골집, 술먹고 다음 날 가면 푸짐하게 배불리 해장 할 수 있는곳, 주말도 ..."
642411,평택,2,카페/디저트,"원래는 평택에 있었는데, 연남동에도 최근에 생겨서 방문 했는데..진짜 줄이 어마어마..."
642412,평택,2,한식,친구들의 추천으로 가보게 된 곳. 안성과 평택 몇군데 위주로 체인점이 있는 소규모 ...

In [107]:
data1.index

RangeIndex(start=0, stop=3, step=1)

In [108]:
data1.columns

Index(['이름', '성별', '나이', '키'], dtype='object')

In [109]:
data1["키"].dtype

dtype('float64')

In [234]:
data1

,Region,Rating,Category,Review
0,인덕원,1,삼겹살 고기집,숙성 돼지고기 전문점입니다. 건물 모양 때문에 매장 모양도 좀 특이하지만 쾌적한 편...
1,인덕원,1,삼겹살 고기집,고기가 정말 맛있었어요! 육즙이 가득있어서 너무 좋았아요\n일하시는분들 너무 친절하...
2,인덕원,1,순대국 찹쌀순대,"잡내없고 깔끔, 담백한 맛의 순대국이 순대국을 안 좋아하는 사람들에게도 술술 넘어갈..."
3,인덕원,1,순대국 찹쌀순대,고기 양이 푸짐해서 특 순대국밥을 시킨 기분이 듭니다~~ 맛도 좋습니다\n다만 양념...
4,인덕원,1,순대국 찹쌀순대,순대국 자체는 제가 먹어본 순대국밥집 중에서 Top5 안에는 들어요.\n\n그러나 ...
...,...,...,...,...
642408,평택,2,일식/중식/세계음식,"요즘, 핫하게,,,떠오르구 있는 중국집. ㅋ, 맥주의 여파루 속이 안좋지만 와봄. ..."
642409,평택,0,한식,원래 글 안쓰는데 이거는 정말 다른분들 위해서 써야할것같네요 방금 포장주문 해서 왔...
642410,평택,1,한식,"우리팀 단골집, 술먹고 다음 날 가면 푸짐하게 배불리 해장 할 수 있는곳, 주말도 ..."
642411,평택,2,카페/디저트,"원래는 평택에 있었는데, 연남동에도 최근에 생겨서 방문 했는데..진짜 줄이 어마어마..."
642412,평택,2,한식,친구들의 추천으로 가보게 된 곳. 안성과 평택 몇군데 위주로 체인점이 있는 소규모 ...

In [237]:
import pandas as pd

data_list = [
    ["김영철", "M", 24, 179.4],
    ["송윤지", "F", 31, 161.0],
    ["임수현", "F", 26, 174]
]
data1 = pd.DataFrame(data_list, columns = ["이름", "성별", "나이", "키"])
# data1.columns = ["이름", "성별", "나이", "키"]
data1

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

In [238]:
# 성별이 M인 데이터 조회 : 조건식 data1["성별"] == "M"
data1[data1["성별"] == "M"]

    이름 성별  나이      키
0  김영철  M  24  179.4

In [239]:
# 성별이 M인 데이터들을 조회
data1.loc[data1["성별"] == "M"]

    이름 성별  나이      키
0  김영철  M  24  179.4

In [ ]:
# 성별이 M인 데이터들의 "키"를 조회 (행, 열)
data1.loc[data1["성별"] == "M", "키"]

0    179.4
Name: 키, dtype: float64

In [ ]:
# 키가 170이 넘는 사람들 조회 : 조건식 data["키"] > 170
data1[data1["키"] > 170]

    이름 성별  나이      키
0  김영철  M  24  179.4
2  임수현  F  26  174.0

In [ ]:
# 성별이 F이면서 키가 170 이상인 사람 조회 (and, &)
# 조건문을 만들 때 if 성별 == "F" and 키 >= 170 :
data1[(data1["성별"] == "F") & (data1["키"] >= 170)]

    이름 성별  나이      키
2  임수현  F  26  174.0

In [124]:
import pandas as pd

data_list = [
    ["홍길동", 25, "서울"],
    ["김준기", 21, "서울"],
    ["이명식", 22, "부산"],
    ["이준혁", 24, "광주"],
    ["최명기", 31, "부산"]
]
data = pd.DataFrame(data_list, columns=["이름", "나이", "지역"])
data

    이름  나이  지역
0  홍길동  25  서울
1  김준기  21  서울
2  이명식  22  부산
3  이준혁  24  광주
4  최명기  31  부산

In [127]:
# 나이가 30 이상인 데이터 조회
data[data["나이"] >= 30]

    이름  나이  지역
4  최명기  31  부산

In [ ]:
# '이'씨 성을 가진 데이터 조회
# data[data["이름"].filter(like="이")]
data[data["이름"].str.startswith("이")]

    이름  나이  지역
2  이명식  22  부산
3  이준혁  24  광주

In [139]:
# 지역이 서울인 데이터 조회
data[data["지역"] == "서울"]

    이름  나이  지역
0  홍길동  25  서울
1  김준기  21  서울

In [ ]:
# 지역이 부산이고 '최'씨 성을 가진 사람의 나이 조회
data.loc[(data["지역"] == "부산") & (data["이름"].str.startswith("최")), "나이"]

    이름  나이  지역
4  최명기  31  부산

## 3) 편집

### (1) 인덱스 제거

In [144]:
data4.reset_index()

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

In [145]:
data4

    성별  나이      키
이름
김영철  M  24  179.4
송윤지  F  31  161.0
임수현  F  26  174.0

### (2) 데이터 병합

In [146]:
data = pd.DataFrame(
    [["강남", 1, 2], ["서초", 4, 5], ["노원", 5, 6]],
    columns = ["지역명", "지점수", "매출"]
)
data

  지역명  지점수  매출
0  강남    1   2
1  서초    4   5
2  노원    5   6

In [147]:
data2 = pd.DataFrame(
    [["강남", 10, 20], ["도봉", 40, 50], ["노원", 50, 60]],
    columns = ["지역명", "지점수", "매출"]
)
data2

  지역명  지점수  매출
0  강남   10  20
1  도봉   40  50
2  노원   50  60

In [148]:
data + data2

    지역명  지점수  매출
0  강남강남   11  22
1  서초도봉   44  55
2  노원노원   55  66

In [155]:
# 병합
total_data = pd.merge(
    left = data,
    right = data2,
    how = "outer",    # left, right, inner(교집합), outer(합집합)
    on = "지역명"
)
total_data

  지역명  지점수_x  매출_x  지점수_y  매출_y
0  강남    1.0   2.0   10.0  20.0
1  노원    5.0   6.0   50.0  60.0
2  도봉    NaN   NaN   40.0  50.0
3  서초    4.0   5.0    NaN   NaN

### (3) 결측치 처리

In [156]:
total_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   지역명     4 non-null      object
 1   지점수_x   3 non-null      float64
 2   매출_x    3 non-null      float64
 3   지점수_y   3 non-null      float64
 4   매출_y    3 non-null      float64
dtypes: float64(4), object(1)
memory usage: 288.0+ bytes

In [157]:
# 결측치가 있는지 확인
total_data.isna()

     지역명  지점수_x   매출_x  지점수_y   매출_y
0  False  False  False  False  False
1  False  False  False  False  False
2  False   True   True  False  False
3  False  False  False   True   True

In [ ]:
# 각 열마다 결측치가 몇개 있는지 확인
total_data.isna().sum(axis=0)   # axis=1 : 각 행마다 결측치가 몇개 있는지

지역명      0
지점수_x    1
매출_x     1
지점수_y    1
매출_y     1
dtype: int64

In [161]:
# 결측치 채우기
total_data.fillna(999)

  지역명  지점수_x   매출_x  지점수_y   매출_y
0  강남    1.0    2.0   10.0   20.0
1  노원    5.0    6.0   50.0   60.0
2  도봉  999.0  999.0   40.0   50.0
3  서초    4.0    5.0  999.0  999.0

In [ ]:
# 결측치 삭제 - 결측치가 하나라도 발생한 행은 삭제
total_data.dropna()

  지역명  지점수_x  매출_x  지점수_y  매출_y
0  강남    1.0   2.0   10.0  20.0
1  노원    5.0   6.0   50.0  60.0

In [179]:
# 특정 열의 결측치 발생한 데이터 삭제
total_data.dropna(subset=["지점수_x"])

  지역명  지점수_x  매출_x  지점수_y  매출_y
0  강남    1.0   2.0   10.0  20.0
1  노원    5.0   6.0   50.0  60.0
3  서초    4.0   5.0    NaN   NaN

## 4) 통계

In [164]:
total_data.describe()

          지점수_x      매출_x      지점수_y       매출_y
count  3.000000  3.000000   3.000000   3.000000
mean   3.333333  4.333333  33.333333  43.333333
std    2.081666  2.081666  20.816660  20.816660
min    1.000000  2.000000  10.000000  20.000000
25%    2.500000  3.500000  25.000000  35.000000
50%    4.000000  5.000000  40.000000  50.000000
75%    4.500000  5.500000  45.000000  55.000000
max    5.000000  6.000000  50.000000  60.000000

# 3. 데이터 불러오기

## 예제 1. cdata.csv 불러오기

In [173]:
data = pd.read_csv("data/cdata.csv", encoding="CP949", index_col=0)
data

   Index   No  Age City
0      1  홍길동   25   서울
1      2  김준기   21   서울
2      9  이명식   22   부산
3     32  방준혁   24   광주
4     47  최명기   31   부산

## 예제 2. cdata_nohead.csv 불러오기

In [ ]:
data = pd.read_csv("data/cdata_nohead.csv",
                   header=None,
                   index_col=0,
                   names=["Index", "No", "Age", "City"])
data

   Index   No  Age City
0      1  홍길동   25   서울
1      2  김준기   21   서울
2      9  이명식   22   부산
3     32  방준혁   24   광주
4     47  최명기   31   부산

## 예제 3. 자동차 회사의연비 데이터

* manufacturer : 회사명
* cty : 도심연비
* hwy : 고속도로 연비

## 데이터 불러오기

In [ ]:
# data/mpg.csv
import pandas as pd
mpg = pd.read_csv("data/mpg.csv")
mpg.head()  # 데이터 맨 앞에서부터 5개(default) 가져오기

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl category
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
3         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
4         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [182]:
mpg.tail()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category
229,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
230,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
231,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
232,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
233,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

## 데이터 파악하기

In [ ]:
mpg.info()  # 234개 중 Non-Null Count 에서 비는게 없으므로 결측치가 없다! -> isna() 따로 안해줘도됨

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 234 entries, 0 to 233
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  category      234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 20.2+ KB

In [186]:
# 데이터가 몇 개 이고, 열이 몇 개 인가?
nrow, ncol = mpg.shape
print(f"mpg 데이터셋은 {nrow}개의 데이터와 {ncol}개의 열을 가지고 있습니다.")

mpg 데이터셋은 234개의 데이터와 11개의 열을 가지고 있습니다.

In [ ]:
mpg.describe()  # float, int 만 모아서 한다 (수치형:default)

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

In [ ]:
# 수치형 데이터가 아닌 다른 유형의 데이터타입을 describe로 정리하고 싶을 때
mpg.describe(include="object")

       manufacturer        model     trans  drv   fl category
count           234          234       234  234  234      234
unique           15           38        10    3    5        7
top           dodge  caravan 2wd  auto(l4)    f    r      suv
freq             37           11        83  106  168       62

## Q1. 몇 개의 회사 데이터가 있나요?

In [190]:
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl category
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
3         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
4         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [191]:
mpg["manufacturer"].unique()

array(['audi', 'chevrolet', 'dodge', 'ford', 'honda', 'hyundai', 'jeep',
       'land rover', 'lincoln', 'mercury', 'nissan', 'pontiac', 'subaru',
       'toyota', 'volkswagen'], dtype=object)

In [195]:
manufacturer_list = mpg["manufacturer"].unique()
print(f"A. {len(manufacturer_list)}개의 회사가 있습니다.")

A. 15개의 회사가 있습니다.

In [193]:
# 'n'을 붙이면 갯수
n_manufacturer = mpg["manufacturer"].nunique()
print(f"A. {n_manufacturer}개의 회사가 있습니다.")

A. 15개의 회사가 있습니다.

## Q2. 회사별로 참여한 자동차가 몇 대인지 파악하세요.

In [ ]:
# a = ["A", "A", "B", "C", "C", "C", "C"]
# A가 몇개이고, B가 몇 개, C가 몇개야? -> value_counts()

In [196]:
# 카테고리별 개수 계산
mpg["manufacturer"].value_counts()

manufacturer
dodge         37
toyota        34
volkswagen    27
ford          25
chevrolet     19
audi          18
hyundai       14
subaru        14
nissan        13
honda          9
jeep           8
pontiac        5
land rover     4
mercury        4
lincoln        3
Name: count, dtype: int64

In [201]:
# 데이터에서 "honda"회사의 데이터는 몇 개?
manufacturers = mpg["manufacturer"].value_counts()
honda_count = manufacturers["honda"]
print(f"honda 회사의 데이터는 {honda_count}개 있습니다.")

honda 회사의 데이터는 9개 있습니다.

## Q3. 도심연비와 고속도로 연비를 평균낸 total 연비를 구하세요

In [202]:
# 도심연비 : cty, 고속도로 연비 : hwy
# 평균 : (도심연비 + 고속도로연비) / 2
mpg["total"] = (mpg["cty"] + mpg["hwy"]) / 2
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0

## Q4. total 연비 상위 10개 자동차의 회사별 개수를 구하세요

In [ ]:
# 1. total열의 상위 10개 회사 추출 - 정렬
temp_data = mpg.sort_values(by=["total"], ascending=False)
temp_data

# temp_data에서 menufacturer 10개의 데이터 가져오기
# temp_data2 = temp_data[:10]   -> 나의 방법
# print(temp_data2)
temp_data2 = temp_data.iloc[:10, :]         #temp_data.head(10)
print(temp_data2)

# temp_data2의 manufacturer의 종류와 개수 구하기(value_count)
temp_data3 = temp_data2["manufacturer"].value_counts()
temp_data3

    manufacturer       model  displ  year  cyl       trans drv  cty  hwy fl  \
221   volkswagen  new beetle    1.9  1999    4  manual(m5)   f   35   44  d
212   volkswagen       jetta    1.9  1999    4  manual(m5)   f   33   44  d
222   volkswagen  new beetle    1.9  1999    4    auto(l4)   f   29   41  d
196       toyota     corolla    1.8  2008    4  manual(m5)   f   28   37  r
197       toyota     corolla    1.8  2008    4    auto(l4)   f   26   35  r
195       toyota     corolla    1.8  1999    4  manual(m5)   f   26   35  r
99         honda       civic    1.6  1999    4  manual(m5)   f   28   33  r
105        honda       civic    1.8  2008    4    auto(l5)   f   25   36  r
104        honda       civic    1.8  2008    4  manual(m5)   f   26   34  r
106        honda       civic    1.8  2008    4    auto(l5)   f   24   36  c

       category  total
221  subcompact   39.5
212     compact   38.5
222  subcompact   35.0
196     compact   32.5
197     compact   30.5
195     compact   30.5
99   subcompact   30.5
105  subcompact   30.5
104  subcompact   30.0
106  subcompact   30.0

manufacturer
honda         4
volkswagen    3
toyota        3
Name: count, dtype: int64

## +Quiz. 현대자동차의 평균 total 연비에 대한 평균값은?

In [217]:
# 1. 현대자동차의 데이터 추출 (hyundai_data)   // 조건식 data["manufacturer"] == "hyundai"
hyundai_data = mpg[mpg["manufacturer"] == "hyundai"]
# 2. hyundai_data total 열의 평균값을 계산
hyundai_data_total_mean = hyundai_data["total"].mean()
print(f"현대자동차의 total열에 대한 평균값은 {hyundai_data_total_mean}입니다.")

현대자동차의 total열에 대한 평균값은 22.75입니다.

## Q5. total열의 값이 total열의 평균보다 높은 자동차는 PASS, 낮은 자동차는 FAIL로 구분하세요.

In [ ]:
import numpy as np

# 1. total열의 평균값을 구한다 (total_mean)
total_mean = mpg["total"].mean()
print(total_mean)
# 2. total열과 total_mean을 비교한다 ( mpg["total"] > total_mean )
mpg["result"] = np.where(mpg["total"] >= total_mean, "PASS", "FAIL")
mpg["result"].value_counts()
# 3. PASS / FAIL 판단

20.14957264957265

result
PASS    123
FAIL    111
Name: count, dtype: int64

In [ ]:
mpg["result"] = mpg["total"].apply(lambda x: "PASS" if x >= total_mean else "FAIL")
mpg["result"].value_counts()

# x는 셀
# 평소에 apply를 많이 쓰긴 하지만, apply는 좀 느리다. 그래서 where도 항상 생각하자!

result
PASS    123
FAIL    111
Name: count, dtype: int64

## +Quiz. PASS인 자동차 중 가장 많은 비율을 차지하는 자동차 회사는?

In [224]:
# 1. result 값이 PASS인 데이터를 추출한다 (pass_data)
pass_data = mpg[mpg["result"] == "PASS"]
# 2. pass_data에서 manufacturer의 카테고리별 개수를 구한다
pass_data["manufacturer"].value_counts()

manufacturer
volkswagen    26
toyota        19
audi          14
subaru        14
hyundai       13
honda          9
nissan         9
chevrolet      7
pontiac        5
dodge          4
ford           3
Name: count, dtype: int64

# 4. 다양한 데이터 체험하기

In [ ]:
# kr3_raw.tsv
    ## sep="\t"
    ## pd.read_csv()
# 국민건강보험공단_.....xlsx
    ## 도구 설치 필요 uv add openpyxl
    ## pd.read_excel()
# kowebs_c19_2024_beta1.sav
    ## 도구 설치 필요 uv add pyreadstat
    ## pd.read_spss()

In [232]:
# kr3_raw.tsv
data1 = pd.read_csv("data/kr3_raw.tsv", sep="\t")
data1

,Region,Rating,Category,Review
0,인덕원,1,삼겹살 고기집,숙성 돼지고기 전문점입니다. 건물 모양 때문에 매장 모양도 좀 특이하지만 쾌적한 편...
1,인덕원,1,삼겹살 고기집,고기가 정말 맛있었어요! 육즙이 가득있어서 너무 좋았아요\n일하시는분들 너무 친절하...
2,인덕원,1,순대국 찹쌀순대,"잡내없고 깔끔, 담백한 맛의 순대국이 순대국을 안 좋아하는 사람들에게도 술술 넘어갈..."
3,인덕원,1,순대국 찹쌀순대,고기 양이 푸짐해서 특 순대국밥을 시킨 기분이 듭니다~~ 맛도 좋습니다\n다만 양념...
4,인덕원,1,순대국 찹쌀순대,순대국 자체는 제가 먹어본 순대국밥집 중에서 Top5 안에는 들어요.\n\n그러나 ...
...,...,...,...,...
642408,평택,2,일식/중식/세계음식,"요즘, 핫하게,,,떠오르구 있는 중국집. ㅋ, 맥주의 여파루 속이 안좋지만 와봄. ..."
642409,평택,0,한식,원래 글 안쓰는데 이거는 정말 다른분들 위해서 써야할것같네요 방금 포장주문 해서 왔...
642410,평택,1,한식,"우리팀 단골집, 술먹고 다음 날 가면 푸짐하게 배불리 해장 할 수 있는곳, 주말도 ..."
642411,평택,2,카페/디저트,"원래는 평택에 있었는데, 연남동에도 최근에 생겨서 방문 했는데..진짜 줄이 어마어마..."
642412,평택,2,한식,친구들의 추천으로 가보게 된 곳. 안성과 평택 몇군데 위주로 체인점이 있는 소규모 ...

In [ ]:
# 국민건강보험공단_.....xlsx
    ## 도구 설치 필요 uv add openpyxl
    ## pd.read_excel()
    ## sheet_name 옵션을 통해 sheet 지정 가능
data2 = pd.read_excel("data/국민건강보험공단_특정 상병별 요양기관종별 및 진료과목별 및 시군구별 진료인원_20231231.xlsx", sheet_name="Sheet5")
data2

       진료연도 진료월     주상병코드      연령  요양기관 시도 요양기관 시군구  요양기관종별 진료인원(명)
0      2020  전체  K50, K51  18세 미만    서울특별시      종로구  상급종합병원     140
1      2020  전체  K50, K51  18세 미만    서울특별시      종로구      의원       *
2      2020  전체  K50, K51  18세 미만    서울특별시      종로구    치과병원       *
3      2020  전체  K50, K51  18세 미만    서울특별시       중구    종합병원       *
4      2020  전체  K50, K51  18세 미만    서울특별시       중구      병원      30
...     ...  ..       ...     ...      ...      ...     ...     ...
39971  2023  12  K50, K51  18세 이상  전북특별자치도      고창군      병원       *
39972  2023  12  K50, K51  18세 이상  전북특별자치도      고창군      의원       *
39973  2023  12  K50, K51  18세 이상  전북특별자치도      부안군      병원       *
39974  2023  12  K50, K51  18세 이상  전북특별자치도      부안군      의원       *
39975  2023  12  K50, K51  18세 이상  전북특별자치도      부안군    한방병원       *

[39976 rows x 8 columns]

In [231]:
# kowebs_c19_2024_beta1.sav
    ## 도구 설치 필요 uv add pyreadstat
    ## pd.read_spss()
    ## sav 파일은 그냥 열려고 하면 안열림 -> spss를 통해 열어야함
data3 = pd.read_spss("data/koweps_c19_2024_beta1.sav")
data3

,h19_id,h19_ind,h19_sn,h19_merkey,h_new,h_new1,h19_pind,h19_pid,c19_fnum,c19_ws_c,...,c1907_4aq14,c1907_4aq15,c1907_4aq16,c1907_4aq17,c1907_4aq18,c1907_4aq19,c1907_4aq20,c1907_4aq21,c1907_4aq22,c1907_4aq23
0,48.0,1.0,1.0,480101.0,0.0,0.0,9.0,4807.0,4.0,1.324813,...,1.0,3.0,3.0,3.0,1.0,3.0,1.0,2.0,2.0,3.0
1,86.0,10.0,1.0,861001.0,0.0,0.0,10.0,8652.0,3.0,1.396315,...,2.0,3.0,3.0,3.0,2.0,3.0,2.0,2.0,2.0,3.0
2,102.0,1.0,1.0,1020101.0,0.0,0.0,11.0,10206.0,6.0,1.255147,...,2.0,3.0,3.0,3.0,1.0,3.0,2.0,1.0,1.0,2.0
3,105.0,9.0,1.0,1050901.0,0.0,0.0,12.0,10553.0,4.0,1.419771,...,1.0,3.0,2.0,3.0,1.0,3.0,2.0,1.0,1.0,3.0
4,139.0,2.0,1.0,1390201.0,0.0,0.0,8.0,13952.0,3.0,1.396315,...,2.0,2.0,4.0,3.0,3.0,2.0,1.0,1.0,1.0,3.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
336,11907.0,17.0,1.0,119071701.0,0.0,1.0,17.0,1190704.0,4.0,NaN,...,2.0,2.0,3.0,3.0,3.0,2.0,2.0,3.0,2.0,3.0
337,11908.0,17.0,1.0,119081701.0,0.0,1.0,17.0,1190803.0,3.0,NaN,...,1.0,3.0,2.0,4.0,1.0,4.0,1.0,1.0,1.0,3.0
338,11970.0,17.0,1.0,119701701.0,0.0,1.0,17.0,1197004.0,4.0,NaN,...,2.0,2.0,3.0,2.0,1.0,2.0,2.0,2.0,2.0,3.0
339,11975.0,17.0,1.0,119751701.0,0.0,1.0,17.0,1197503.0,3.0,NaN,...,3.0,3.0,3.0,3.0,2.0,3.0,2.0,2.0,2.0,3.0
340,12001.0,17.0,1.0,120011701.0,0.0,1.0,17.0,1200104.0,4.0,NaN,...,1.0,3.0,3.0,3.0,1.0,3.0,2.0,2.0,2.0,3.0